{
    "summary": "Full stack Software developer with 6+ years of experience building web applications using React, TypeScript, NodeJS, SQL and cloud-native systems. Experienced in delivering end to end features: from UI/UX prototyping to backend REST APIs, authentication, real-time dashboards, and cloud deployment. Focused on building simple and intuitive features for complicated problems that make a better experience for the user.",
    "skills_interests": {
      "Frontend": "JavaScript, React JS, Redux, TypeScript, Angular, React Native, Blazor, Bootstrap",
      "Backend": "NodeJS, Python, .Net(C#), Go",
      "Database": "MySQL, PostgreSQL, MongoDB, Redis, NoSQL",
      "DevOps/OS": "Azure, Kubernetes, Docker, AWS, Linux",
      "AI Tools": "Copilot, Gemini, ChatGPT",
      "Version Control/ SDLC/ tools": "Jira, Scrum, Git, Agile, Figma, Kanban",
      "Other": ""
    },
      "experience": [
        {
          "company": "SES Americom",
          "role": "Software Engineer",
          "location": "Bristow, VA, USA",
          "startDate": "2024-04",
          "description": [
            "Led the redesign of web applications, modernizing both application architecture and website design by restructuring frontend and backend into a loosely coupled modular system using JavaScript, Blazor, and React.",
            "Prototyped data-dense dashboards in Figma, collaborating with satellite controllers to refine designs, establish visual hierarchy, and surface critical information.",
            "Designed reusable, stateless React and TypeScript components, decoupling business logic for cross-application reuse.",
            "Improved dashboard performance by upgrading LightningChart to version 6, eliminating per-frame cursor redraws and reducing lag.",
            "Reduced network latency by replacing HTTP polling with C# gRPC streaming using Protobuf serialization and persistent TCP connections, supporting 50% more concurrent operators.",
            "Built real-time and historical data systems using WebSockets/SignalR for live telemetry and GraphQL APIs for historical data across distributed .NET services.",
            "Deployed scalable satellite operations applications using Azure and Kubernetes with CI/CD automation."
          ]
        },
        {
          "company": "Southern Illinois University Edwardsville",
          "role": "Graduate Teaching Assistant",
          "location": "Edwardsville, IL, USA",
          "startDate": "2022-08",
          "endDate": "2023-12",
          "description": [
            "Facilitated office hours and supported students in Design and Analysis of Algorithms.",
            "Assisted students with Database and Web System Development concepts and problem-solving."
          ]
        },
        {
          "company": "Leapfrog Technology Pvt. Ltd",
          "role": "Software Engineer",
          "location": "Kathmandu, Nepal",
          "startDate": "2018-11",
          "endDate": "2022-01",
          "description": [
            "Led a team of six front-end engineers, driving application design, code reviews, and performance optimization in ReactJS with Redux for centralized state management.",
            "Built shared GitHub-based frontend component libraries reused across five teams, standardizing UI/UX.",
            "Implemented Microsoft login using OAuth 2.0 integrated with Azure Functions.",
            "Developed an API Gateway in Node.js using MVC patterns to centralize routing and authentication.",
            "Reduced QA testing time by 60% with Mocha-based unit tests for NodeJS services.",
            "Optimized healthcare RESTful APIs using Go, improving query efficiency and implementing PostgreSQL encryption.",
            "Improved read performance by migrating SQL-heavy operations to MongoDB, increasing response speed by 30%.",
            "Containerized services with Docker and implemented CI/CD pipelines across AWS environments.",
            "Developed AWS Lambda functions for event-driven email notifications.",
            "Built responsive web applications using HTML5, CSS, Bootstrap, React, and TypeScript."
          ]
        },
        {
          "company": "LIS Pvt. Ltd",
          "role": "Software Engineer Intern",
          "location": "Lalitpur, Nepal",
          "startDate": "2018-03",
          "endDate": "2018-07",
          "description": [
            "Built AngularJS applications and integrated REST APIs to display data in user interfaces.",
            "Used PostgreSQL for data storage and retrieval.",
            "Created low-fidelity wireframes for improving existing websites."
          ]
        },
        {
          "company": "AMNIL Technologies Pvt. Ltd.",
          "role": "Trainee",
          "location": "Lalitpur, Nepal",
          "startDate": "2017-06",
          "endDate": "2018-02",
          "description": [
            "Built a Windows desktop application for pharmacy management using C# and .NET.",
            "Implemented CRUD operations in relational databases for data storage and retrieval."
          ]
        }
      ]
    ,
    
    "education": [{
      "title": "Master of Computer Science",
      "gpa": 3.7,
      "date": "Jan 2022 - Dec 2023",
      "institution": "Southern Illinois University Edwardsville",
      "location": "Edwardsville, IL ,USA"
    },{
      "title": "Bachelor of Engineering, Computer Engineering",
      "gpa": 3.7,
      "date": "Aug 2014 – Sep 2018",
      "institution": "Tribhuvan University",
      "location": "Kathmandu, Nepal"
    }
    ],
    "certifications" :[{
      "title":  "Google AI Essentials — Coursera",
      "date": "November 18, 2025",
      "url": "https://coursera.org/share/8cecfbce9dcb122c733182d3e9d832d4"
    }],
    "projects": [
      {
        "title": "Pokemon Catcher",
        "imageUrl": "/pokemon.png",
        "demoUrl": "https://shanushka.github.io/pokemon/",
        "githubUrl": "https://github.com/shanushka/pokemon",
        "technologies": ["Vanilla Javascript", "Html", "CSS", "2D Grid Map"],
        "startDate": "2019",
        "description": [
          "Built in Vanilaa Javascript without external libraries.",
          "Character goes through map to catch pokemon"
        ]
      },
      {
        "title": "Preprocessing Lyric Embeddings",
        "imageUrl": "/genreClassification.png",
        "demoUrl": "https://github.com/shanushka/GenreClassification/blob/main/Filtered-Classification-word2vec.ipynb",
        "githubUrl": "hhttps://github.com/shanushka/GenreClassification/tree/main",
        "technologies": ["Python", "Machine Learning", "Numpy", "Panda"],
        "startDate": "2019",
        "description": [
          "Enhanced music genre classification by refining test datasets through lyrics analysis.",
          "Implemented lyrics-embedding preprocessing using NumPy and pandas, filtering high cosine-similarity vectors to minimize semantic overlap.",
          "Improved accuracy for Logistic Regression, Gaussian Naive Bayes, and Neural Network models.",
          "Contributed improvements to music recommendation systems and advanced natural language processing research."
        ]
      },
      {
        "title": "Flappy Bird",
        "imageUrl": "/flappybird.png",
        "demoUrl": "https://shanushka.github.io/js-projects/assignment-3/",
        "githubUrl": "https://github.com/shanushka/js-projects/tree/master/assignment-3",
        "technologies": ["Vanilla Javascript", "Html", "CSS", "2D Grid Map"],
        "startDate": "2019",
        "description": [
          "Built in Vanilaa Javascript without external libraries.",
          "Built Flappy bird game"
        ]
      }
    
    ],
    
    "other": [
      "ANUSHKA SHRESTHA",
      "VA , US| | github.com/shanushka | anushkashrestha24@gmail.com | www.linkedin.com/in/anushka--shrestha"
    ]
  }